# PointCloudFilterFactory Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointCloudFilterFactory Methods
PointCloudFilterFactory Class See Also
---
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateMultiPlaneFilter(IList<(Of <<'(Plane>)>>)) | Creates a new point cloud filter based upon planar boundaries. |
| CreateMultiPlaneFilter(IList<(Of <<'(Plane>)>>), Int32) | Creates a new point cloud filter based upon planar boundaries. |

# See Also
PointCloudFilterFactory Class
Autodesk.Revit.DB.PointClouds Namespace